#coding=utf-8

a = '**0**专辑：文武贝钢琴改编作品集（2015年全集)@2015艺术家：文武贝歌曲名：南山南-文武贝钢琴版 -----------------------------------'

b = a.decode('utf-8')
print b

'''


**1**专辑：南山南
艺术家：刘志严
歌曲名：南山南
-----------------------------------
**2**专辑：六局完胜
艺术家：留声玩具
歌曲名：不要唱南山南也不要哼哼北秋悲
-----------------------------------
**3**专辑：CatmeoWang作品集
艺术家：catmeowang
歌曲名：南山南
-----------------------------------
**4**专辑：Acoustic Covers
艺术家：CANNIE
歌曲名：南山南
-----------------------------------
**5**专辑：喜欢民谣的傻瓜
艺术家：运百和
歌曲名：南山南
-----------------------------------
**6**专辑：南山南 信通版
艺术家：信通
歌曲名：南山南
-----------------------------------
**7**专辑：南山南
艺术家：大坏兔子
歌曲名：南山南-指弹
-----------------------------------
**8**专辑：南山南
艺术家：张萌川
歌曲名：南山南
-----------------------------------
**9**专辑：南山南 demo
艺术家：张正奇
歌曲名：《南山南》
-----------------------------------

'''